i = int(input())
if i ==1:
    n = int(input())
    if n==1:
        print(1)
    elif n==2:
        print(4)
    else:
        print(10)
elif i==6:
    s="창의력, 인내력, 근력, 지구력, 잉여력, 탄성력, 판단력, 노력, 기력, 활동력, 활력, 달력, 내구력, 변형력, 응집력, 무력, 지력, 매력, 미력, 담력, 능력, 실력, 압력, 협력, 체력, 경력, 폭력, 세력, 양력, 음력, 입력, 출력, 권력, 주력, 병력, 전력, 마찰력, 동력, 전기력, 효력, 내력, 국력, 자기력, 중력, 화력, 수력, 원자력, 영향력, 이력, 경쟁력, 경제력, 설득력, 공권력, 원동력, 정치력, 집중력, 추진력, 연기력, 잠재력, 정신력, 부력, 재력, 마력, 유력, 조력, 여력, 초능력, 예지력, 표현력, 기억력, 무기력, 창조력, 순발력, 지배력, 저항력, 호소력, 관찰력, 구속력, 풍력, 청력, 시력, 학력, 필력, 완력, 사력, 수사력, 자생력, 고학력, 번식력, 자금력, 포용력, 정력, 편력, 속력, 피력, 지도력, 통제력, 기동력, 사고력, 무중력, 결정력, 이해력, 친화력, 결단력, 태양력, 공격력, 방어력, 돌파력, 장악력, 전속력, 흡인력, 괴력, 극력, 독력, 경기력, 기획력, 득점력, 적응력, 파괴력, 행정력, 구매력, 도약력, 반발력, 진력, 금력, 강력, 약력, 정치권력, 분석력, 세정력, 자제력, 반작용력, 만유인력, 근지구력, 진심전력, 불가항력, 청천벽력, 폭발력, 형성력, 견제력, 장력, 각력, 감항능력, 겸인지력, 결심육력, 고광지력, 구사력, 단결력, 생활력, 수비력, 운동력, 교정시력, 공력, 어휘력, 군책군력, 구태양력, 조직력, 가창력, 문장력, 발표력, 교력, 궁력, 동심합력, 방위력, 소비력, 연출력, 자본력, 주도력, 그레고리력, 율리우스력, 마호메트력, 무능력, 작용력, 주동력, 가로복원력, 강제통영력, 게이지압력, 경제잠재력, 분투노력, 공소의효력, 불유여력, 직감력, 직관력, 추리력, 충격력, 횡압력, 감별력, 결합력, 기술력, 미적판단력, 발전소출력, 사회적압력, 신통력, 동원력, 가호력, 다력, 대력, 감각력, 감득력, 자기세력, 일심협력, 이집트력, 정지마찰력, 잠재구매력, 최대마찰력, 감상력, 개괄력, 개발력, 개념력, 도력, 구상력, 관통력, 물력, 기조력, 기전력, 담세력, 독서력, 독창력, 법력, 강한핵력, 약한핵력"
    print(*s.split(", "))
elif i ==8:
    print("대회 운영진")